In [1]:
import numpy as np
import pandas as pd

# Group By

In [8]:
df = pd.DataFrame([
    {'nama':'Andi', 'nilai':90},
    {'nama':'Andi', 'nilai':94},
    {'nama':'Andi', 'nilai':95},
    {'nama':'Andi', 'nilai':96},
    {'nama':'Budi', 'nilai':92},
    {'nama':'Budi', 'nilai':90},       

])
dfGroup = df.groupby('nama')
# dfGroup.get_group('Budi')
df
# dfGroup.min()
# dfGroup.max()
# dfGroup.mean()

   nama  nilai
0  Andi     90
1  Andi     94
2  Andi     95
3  Andi     96
4  Budi     92
5  Budi     90

In [3]:

df = pd.DataFrame([
    {'nama':'Andi','fisika':90, 'biologi':78},
    {'nama':'Andi','fisika':95, 'biologi':80},
    {'nama':'Andi','fisika':93, 'biologi':96},
    {'nama':'Andi','fisika':92, 'biologi':95},
    {'nama':'Budi','fisika':80, 'biologi':93},
    {'nama':'Budi','fisika':88, 'biologi':90},       

])
dfGroup = df.groupby('nama')
# dfGroup.get_group('Budi')
# dfGroup.min()
# dfGroup.max()
dfGroup.mean()
dfGroup.get_group('Andi').max()
df[df['nama']=='Andi']['fisika'].max()

95

# concat

In [15]:
df1 = pd.DataFrame([
     {'nama':'Andi','fisika':90, 'biologi':78},
     {'nama':'fahri','fisika':95, 'biologi':78},
     {'nama':'Bambang','fisika':94, 'biologi':78},
])
df2 = pd.DataFrame([
     {'nama':'Budi','fisika':90, 'biologi':68},
     {'nama':'Caca','fisika':84, 'biologi':78},
     {'nama':'Euis','fisika':88, 'biologi':98},

])

dfx = pd.concat([df1,df2])
dfx

      nama  fisika  biologi
0     Andi      90       78
1    fahri      95       78
2  Bambang      94       78
0     Budi      90       68
1     Caca      84       78
2     Euis      88       98

In [76]:
df1 = pd.DataFrame([
     {'nama':'Andi','fisika':90, 'biologi':78},
     {'nama':'fahri','fisika':95, 'biologi':78},
     {'nama':'Bambang','fisika':94, 'biologi':78},
])
df2 = pd.DataFrame([
     {'nama':'Budi','fisika':90, 'biologi':68},
     {'nama':'Caca','fisika':84, 'biologi':78},
     {'nama':'Euis','fisika':88, 'biologi':98},

])

dfx = pd.concat([df1,df2],
               keys=['tes 1','tes 2'])
dfx

            nama  fisika  biologi
tes 1 0     Andi      90       78
      1    fahri      95       78
      2  Bambang      94       78
tes 2 0     Budi      90       68
      1     Caca      84       78
      2     Euis      88       98

In [9]:
dfx.iloc[0]

nama       Andi
fisika       90
biologi      78
Name: 0, dtype: object

In [10]:
dfx.loc[0]

   nama  fisika  biologi
0  Andi      90       78
0  Budi      90       68

In [12]:
dfx = pd.concat([df1,df2],ignore_index=True)
dfx

      nama  fisika  biologi
0     Andi      90       78
1    fahri      95       78
2  Bambang      94       78
3     Budi      90       68
4     Caca      84       78
5     Euis      88       98

In [14]:


df1 = pd.DataFrame([
     {'nama':'Andi','fisika':90, 'biologi':78},
     {'nama':'fahri','fisika':95, 'biologi':78},
     {'nama':'Bambang','fisika':94, 'biologi':78},
])
df2 = pd.DataFrame([
     {'nama':'Budi','math':90, 'biologi':68},
     {'nama':'Caca','math':84, 'biologi':78},
     {'nama':'Euis','math':88, 'biologi':98},

])

dfx = pd.concat([df1,df2], ignore_index=True, sort = False)
dfx

      nama  fisika  biologi  math
0     Andi    90.0       78   NaN
1    fahri    95.0       78   NaN
2  Bambang    94.0       78   NaN
3     Budi     NaN       68  90.0
4     Caca     NaN       78  84.0
5     Euis     NaN       98  88.0

In [22]:

df1 = pd.DataFrame([
     {'nama':'Budi','math':90, 'biologi':68},
     {'nama':'Caca','math':84, 'biologi':78},
     {'nama':'Euis','math':88, 'biologi':98},
])
df2 = pd.DataFrame([
     {'nama':'Budi','kimia':90, 'fisika':68},
     {'nama':'Caca','kimia':84, 'fisika':78},
     {'nama':'Euis','kimia':88, 'fisika':98},

])

dfx = pd.concat([df1,df2], axis = 1,ignore_index=True, sort = False)
dfx

      0   1   2     3   4   5
0  Budi  90  68  Budi  90  68
1  Caca  84  78  Caca  84  78
2  Euis  88  98  Euis  88  98

In [25]:

df1 = pd.DataFrame([
     {'nama':'Budi','math':90, 'biologi':68},
     {'nama':'Caca','math':84, 'biologi':78},
     {'nama':'Euis','math':88, 'biologi':98},
],index=[0,1,2])
df2 = pd.DataFrame([
     {'nama':'Caca','kimia':90, 'fisika':68},
     {'nama':'Budi','kimia':84, 'fisika':78},
     {'nama':'Euis','kimia':88, 'fisika':98},

],index=[1,0,2])

dfx = pd.concat([df1,df2], axis = 1,ignore_index=True, sort = False)
dfx

      0   1   2     3   4   5
0  Budi  90  68  Budi  84  78
1  Caca  84  78  Caca  90  68
2  Euis  88  98  Euis  88  98

# merge = join     /case paling banyak

In [29]:
df1 = pd.DataFrame([
     {'nama':'Budi','math':90, 'biologi':68},
     {'nama':'Caca','math':84, 'biologi':78},
     {'nama':'Euis','math':88, 'biologi':98},
     {'nama':'Deni'}
])
df2 = pd.DataFrame([
     {'nama':'Euis','kimia':90, 'fisika':68},
     {'nama':'Budi','kimia':84, 'fisika':78},
     {'nama':'Caca','kimia':88, 'fisika':98},
     {'nama':'Deni','kimia':88, 'fisika':98},
])

dfx = pd.merge(df1, df2)
dfx

   nama  math  biologi  kimia  fisika
0  Budi  90.0     68.0     84      78
1  Caca  84.0     78.0     88      98
2  Euis  88.0     98.0     90      68
3  Deni   NaN      NaN     88      98

In [30]:
df1 = pd.DataFrame([
     {'nama':'Budi','math':90, 'biologi':68},
     {'nama':'Caca','math':84, 'biologi':78},
     {'nama':'Euis','math':88, 'biologi':98},
#      {'nama':'Deni'}
])
df2 = pd.DataFrame([
     {'nama':'Euis','kimia':90, 'fisika':68},
     {'nama':'Budi','kimia':84, 'fisika':78},
     {'nama':'Caca','kimia':88, 'fisika':98},
     {'nama':'Deni','kimia':88, 'fisika':98},
])

dfx = pd.merge(df1, df2, on='nama', how='outer')
dfx

   nama  math  biologi  kimia  fisika
0  Budi  90.0     68.0     84      78
1  Caca  84.0     78.0     88      98
2  Euis  88.0     98.0     90      68
3  Deni   NaN      NaN     88      98

# Pivot

In [3]:
df = pd.DataFrame([
     {'test':1,'nama':'Andi','fisika':90, 'biologi':68},
     {'test':2,'nama':'Andi','fisika':84, 'biologi':78},
     {'test':3,'nama':'Andi','fisika':88, 'biologi':98},
     {'test':1,'nama':'Budi','fisika':90, 'biologi':68},
     {'test':2,'nama':'Budi','fisika':84, 'biologi':78},
     {'test':3,'nama':'Budi','fisika':88, 'biologi':98},
])

df =df.pivot(index='test',columns='nama')
df

     fisika      biologi
nama   Andi Budi    Andi Budi
test
1        90   90      68   68
2        84   84      78   78
3        88   88      98   98

In [40]:
df['fisika']

nama  Andi  Budi
test
1       90    90
2       84    84
3       88    88

In [41]:
df.loc[1]

         nama
fisika   Andi    90
         Budi    90
biologi  Andi    68
         Budi    68
Name: 1, dtype: int64

In [43]:
df['fisika']['Andi'].loc[1]

90

In [44]:
df.columns

MultiIndex([( 'fisika', 'Andi'),
            ( 'fisika', 'Budi'),
            ('biologi', 'Andi'),
            ('biologi', 'Budi')],
           names=[None, 'nama'])

In [45]:
df['biologi']['Budi'].loc[1]

68

In [5]:
df[1::2]

     fisika      biologi
nama   Andi Budi    Andi Budi
test
2        84   84      78   78

In [6]:
df['fisika']

nama  Andi  Budi
test
1       90    90
2       84    84
3       88    88

In [49]:
df = pd.DataFrame({
    'mapel':['biologi', 'biologi', 'fisika', 'fisika'],
    'nama': ['andi', 'budi', 'andi', 'budi'],
    'nilai': [78,79,90,65]
})
df

     mapel  nama  nilai
0  biologi  andi     78
1  biologi  budi     79
2   fisika  andi     90
3   fisika  budi     65

In [69]:
df = pd.DataFrame({
    'mapel':['biologi', 'biologi','biologi','fisika', 'fisika', 'fisika'],
    'test': [1,2,3,1,2,3],
    'andi':[67, 87,98,67,87,76],
    'budi' :[34,76,65,75,78,76]
})
df = df.set_index(['mapel','test'])
# df = df.set_index(['test','mapel']).unstack().swaplevel(0,1,1)
# df = df.swaplevel(0,1,1).sort_index(1)

df.columns

Index(['andi', 'budi'], dtype='object')

In [71]:
df

              andi  budi
mapel   test
biologi 1       67    34
        2       87    76
        3       98    65
fisika  1       67    75
        2       87    78
        3       76    76

In [ ]:
# 1.BPS => Multi index
# 2.pd.melt
# 3.pd.crosstab
# 4.pd.read_sql => query
# 5.pd.read_sql_table => table